Repository: hypery11/DaveTheDiverSaveEditor
Catalog: App/Sources/Localizable.xcstrings
Source language: en
Languages: ko, zh_hans, zh_hant

source: A free, open-source, 100% local save editor for macOS.
ko: 100% 로컬에서 동작하는 macOS용 무료 오픈소스 세이브 편집기입니다.
zh_hans: 免费开源、100% 本地运行的 macOS 存档修改器。
zh_hant: 免費、開放原始碼、100% 在本機運作的 macOS 存檔修改器。

source: A timestamped backup is saved automatically each time you write this save.
ko: 이 세이브를 저장할 때마다 시각이 기록된 백업이 자동으로 만들어집니다.
zh_hans: 每次写入存档时，都会自动保存一份带时间戳的备份。
zh_hant: 每次寫入此存檔時，都會自動建立一份帶時間戳記的備份。

source: About %@
ko: %@ 정보
zh_hans: 关于 %@
zh_hant: 關於 %@

source: Add
ko: 추가
zh_hans: 增加
zh_hant: 增加

# Add %lld to %@
source: Add %1$lld to %2$@
ko: %2$@에 %1$lld 추가
zh_hans: 为 %2$@ 增加 %1$lld
zh_hant: 為 %2$@ 增加 %1$lld

source: Advanced
ko: 고급
zh_hans: 高级
zh_hant: 進階

source: An independent reimplementation in Swift — not a fork.
ko: 포크가 아니라 Swift로 새로 구현한 독립 프로젝트입니다.
zh_hans: 使用 Swift 独立重写实现，并非 fork。
zh_hant: 以 Swift 獨立重新實作，並非 fork。

source: Artisan's Flame
ko: 장인의 불꽃
zh_hans: 匠人之火
zh_hant: 達人的火花

source: Back to %@ — the value this save was opened with
ko: %@(으)로 — 이 세이브를 열었을 때의 값
zh_hans: 回到 %@——打开此存档时的数值
zh_hant: 回到 %@ — 開啟此存檔時的數值

source: Backup Restored
ko: 백업 복구 완료
zh_hans: 备份已恢复
zh_hant: 備份已回復

source: Bei
ko: 베이
zh_hans: 贝币
zh_hant: 貝伊

source: Bulk edits
ko: 일괄 편집
zh_hans: 批量修改
zh_hant: 批次修改

source: Can't Restore Yet
ko: 아직 복구할 수 없음
zh_hans: 暂时无法恢复
zh_hant: 目前無法回復

source: Can't Write Yet
ko: 아직 저장할 수 없음
zh_hans: 暂时无法写入
zh_hant: 目前無法寫入

source: Cancel
ko: 취소
zh_hans: 取消
zh_hant: 取消

source: Choose Another…
ko: 다른 파일 선택…
zh_hans: 选择其他…
zh_hant: 選擇其他…

source: Clear
ko: 지우기
zh_hans: 清空
zh_hant: 清除

source: Cooksta followers — a progression stat
ko: 쿡스타 팔로워 — 진행도 수치
zh_hans: COOKSTA 粉丝数——游戏进度数值
zh_hant: COOKSTA 追蹤人數 — 進度數值

source: Copy All
ko: 모두 복사
zh_hans: 全部复制
zh_hant: 全部拷貝

source: Copy Diagnostics
ko: 진단 정보 복사
zh_hans: 复制诊断信息
zh_hant: 拷貝診斷資訊

source: Could Not Read Save
ko: 세이브를 읽을 수 없음
zh_hans: 无法读取存档
zh_hant: 無法讀取存檔

source: Could not load the bundled ingredient reference database: %@
ko: 내장 식재료 참조 데이터베이스를 불러오지 못했습니다: %@
zh_hans: 无法加载内置食材参考数据库：%@
zh_hant: 無法載入內建的食材參考資料庫：%@

source: Could not restore the backup: %@
ko: 백업을 복구하지 못했습니다: %@
zh_hans: 无法恢复备份：%@
zh_hant: 無法回復備份：%@

source: Could not write the save: %@
ko: 세이브를 저장하지 못했습니다: %@
zh_hans: 无法写入存档：%@
zh_hant: 無法寫入存檔：%@

source: Couldn't read save
ko: 세이브 읽기 실패
zh_hans: 读取存档失败
zh_hant: 無法讀取存檔

source: Couldn't set item %@ (no inventory container).
ko: 아이템 %@을(를) 설정하지 못했습니다(인벤토리 없음).
zh_hans: 无法设置道具 %@（未找到背包容器）。
zh_hant: 無法設定道具 %@（找不到背包容器）。

source: Count
ko: 개수
zh_hans: 数量
zh_hant: 數量

source: Credit
ko: 신뢰도
zh_hans: 信任度
zh_hant: 信賴度

source: Credits
ko: 크레딧
zh_hans: 致谢
zh_hant: 致謝

source: Dave the Diver is still running. Quit the game fully (⌘Q) before writing — a running game overwrites your edits on its next save.
ko: 데이브 더 다이버가 아직 실행 중입니다. 기록하기 전에 게임을 완전히 종료하세요(⌘Q). 실행 중인 게임은 다음 저장에서 편집 내용을 덮어씁니다.
zh_hans: 《潜水员戴夫》仍在运行。写入前请完全退出游戏（⌘Q）——运行中的游戏会在下次保存时覆盖你的修改。
zh_hant: 《潛水員戴夫》仍在執行。寫入前請完全結束遊戲（⌘Q）— 執行中的遊戲會在下次存檔時覆寫你的修改。

source: Discard & Open
ko: 버리고 열기
zh_hans: 放弃更改并打开
zh_hant: 捨棄並開啟

source: Discard unsaved changes?
ko: 저장하지 않은 변경 사항을 버릴까요?
zh_hans: 放弃未保存的更改？
zh_hant: 要捨棄未儲存的變更嗎？

source: DiveSaveEd Help
ko: DiveSaveEd 도움말
zh_hans: DiveSaveEd 帮助
zh_hant: DiveSaveEd 說明

source: DiveSaveEd is free and always will be — I maintain it on my own.
ko: DiveSaveEd는 무료이고 계속 무료입니다. 혼자 만들고 관리하고 있습니다.
zh_hans: DiveSaveEd 是免费的，而且会一直免费——我一个人在维护它。
zh_hant: DiveSaveEd 是免費的，而且會一直免費 —— 我一個人在維護它。

source: DiveSaveEd is free — I could really use your help
ko: DiveSaveEd는 무료입니다 — 도움이 정말 필요합니다
zh_hans: DiveSaveEd 是免费的——我真的需要你的帮忙
zh_hant: DiveSaveEd 是免費的 —— 我真的需要你的幫忙

source: DiveSaveEd is free — please consider supporting it
ko: DiveSaveEd는 무료입니다 — 후원을 고려해 주세요
zh_hans: DiveSaveEd 是免费的——请考虑赞助
zh_hant: DiveSaveEd 是免費的 —— 請考慮贊助

source: Don't show this again
ko: 다시 표시하지 않기
zh_hans: 不再显示
zh_hant: 不再顯示

source: Donations go through a crypto wallet page — there's no card option.
ko: 후원은 암호화폐 지갑 페이지를 통해 이루어지며, 카드 결제는 없습니다.
zh_hans: 赞助通过加密货币钱包页面进行，没有信用卡选项。
zh_hant: 贊助是透過加密貨幣錢包頁面進行，沒有信用卡選項。

source: Done
ko: 완료
zh_hans: 完成
zh_hant: 完成

source: Early in the game some values are recomputed by story scripts — reload and check they stuck.
ko: 게임 초반에는 일부 값이 스토리 스크립트에 의해 다시 계산됩니다. 세이브를 다시 불러와 적용됐는지 확인하세요.
zh_hans: 游戏前期部分数值会被剧情脚本重新计算——请重新载入存档确认修改是否生效。
zh_hant: 遊戲前期部分數值會被劇情腳本重新計算 — 請重新載入存檔確認修改是否生效。

source: Economy
ko: 재화
zh_hans: 经济
zh_hant: 經濟

# Failed to read %@: %@
source: Failed to read %1$@: %2$@
ko: %@ 읽기 실패: %@
zh_hans: 读取 %@ 失败：%@
zh_hant: 讀取 %@ 失敗：%@

source: Fake Point
ko: 가짜 포인트
zh_hans: 伪造点数
zh_hant: 偽造點數

source: Fill and inject every DLC-owned ingredient (skips aberration fish). Adds ingredients you haven't discovered yet.
ko: DLC 식재료를 모두 채워 넣습니다(돌연변이 물고기 제외). 아직 발견하지 않은 식재료도 추가됩니다.
zh_hans: 填满并注入所有 DLC 食材（跳过突变鱼）。会添加你还没发现的食材。
zh_hant: 補滿並注入所有 DLC 食材（略過突變魚）。會加入你還沒發現的食材。

source: Fill every ingredient you already own (skips perishable aberration fish).
ko: 보유 중인 식재료를 모두 채웁니다(사라지는 돌연변이 물고기 제외).
zh_hans: 填满所有已拥有的食材（跳过易腐的突变鱼）。
zh_hant: 補滿所有已擁有的食材（略過易腐的突變魚）。

source: Fill every owned seed / produce stack in the home farm.
ko: 농장의 보유 씨앗·작물을 모두 채웁니다.
zh_hans: 填满农场中所有已拥有的种子／作物。
zh_hant: 補滿農場中所有已擁有的種子／作物。

source: Fill the Sea People Village storage.
ko: 어인족 마을 인벤토리를 채웁니다.
zh_hans: 填满鲛人村库存。
zh_hant: 補滿魚人村的庫存。

source: Follower Count
ko: 팔로워 수
zh_hans: 粉丝数
zh_hant: 追蹤人數

source: Found your latest save.
ko: 최신 세이브를 찾았습니다.
zh_hans: 已找到最新存档。
zh_hant: 已找到最新的存檔。

source: Free, and staying that way — no ads, no paid version, nothing locked.
ko: 무료이고 계속 무료입니다 — 광고도, 유료 버전도, 잠긴 기능도 없습니다.
zh_hans: 免费，而且会一直免费——没有广告、没有付费版、没有被锁的功能。
zh_hant: 免費，而且會一直免費 —— 沒有廣告、沒有付費版、沒有被鎖的功能。

source: Gold
ko: 골드
zh_hans: 金币
zh_hant: 金幣

source: I build and maintain this on my own, in my spare time, and give it away free — no ads, no paid version, nothing locked.
ko: 이 앱은 제가 혼자, 남는 시간에 만들고 관리하며 무료로 공개하고 있습니다. 광고도, 유료 버전도, 잠긴 기능도 없습니다.
zh_hans: 这个应用是我一个人用业余时间做和维护的，免费给大家用——没有广告、没有付费版、没有被锁的功能。
zh_hant: 這個程式是我一個人用業餘時間做和維護的，免費給大家用 —— 沒有廣告、沒有付費版、沒有被鎖的功能。

source: I still haven't been able to afford the In the Jungle DLC, which is why the app can't fill Jungle items yet — I can't build data for content I don't own.
ko: 아직 "인 더 정글" DLC를 살 여유가 없어서, 앱이 정글 아이템을 채우지 못합니다. 제가 갖고 있지 않은 콘텐츠의 데이터는 만들 수가 없습니다.
zh_hans: 我到现在还买不起《丛林》DLC，这也是应用还没办法填充丛林道具的原因——我没有的内容，就做不出数据。
zh_hant: 我到現在還買不起《叢林》DLC，這也是程式還沒辦法補滿叢林道具的原因 —— 我沒有的內容，就做不出資料。

source: If DiveSaveEd saved you hours of grinding, please consider chipping in. Donations are crypto only, and any amount at all helps.
ko: DiveSaveEd가 노가다 시간을 아껴 드렸다면 조금만 보태 주시면 좋겠습니다. 후원은 암호화폐만 받고, 금액은 얼마든 도움이 됩니다.
zh_hans: 如果 DiveSaveEd 帮你省下了几小时的刷素材时间，希望你能考虑赞助一点。赞助只收加密货币，多少都有帮助。
zh_hant: 如果 DiveSaveEd 幫你省下了幾小時的刷取時間，希望你能考慮贊助一點。贊助只收加密貨幣，多少都有幫助。

source: Inventory
ko: 인벤토리
zh_hans: 背包
zh_hant: 背包

source: Level every hired restaurant staff member to the cap (20).
ko: 고용한 식당 직원을 모두 최대 레벨(20)로 올립니다.
zh_hans: 将所有已雇佣的餐厅员工提升至满级（20 级）。
zh_hant: 將所有已雇用的餐廳員工提升至等級上限（20）。

source: Load Latest Save
ko: 최신 세이브 불러오기
zh_hans: 载入最新存档
zh_hant: 載入最新存檔

source: Main restaurant & shop currency
ko: 식당·상점 기본 재화
zh_hans: 餐厅与商店的主要货币
zh_hant: 餐廳與商店的主要貨幣

source: Max
ko: 최대
zh_hans: 拉满
zh_hant: 最大值

source: Max All
ko: 전체 최대
zh_hans: 全部拉满
zh_hant: 全部補滿

source: Max All Ingredients
ko: 모든 식재료 최대
zh_hans: 全部食材拉满
zh_hant: 所有食材補滿

source: Max Branch
ko: 분점 최대
zh_hans: 分店拉满
zh_hant: 分店補滿

source: Max Branch Store
ko: 분점 식재료 최대
zh_hans: 分店库存拉满
zh_hant: 分店食材補滿

source: Max Caught-Fish Grade
ko: 잡은 물고기 등급 최대
zh_hans: 已捕鱼类等级拉满
zh_hant: 已捕魚類滿級

source: Max Craft
ko: 제작 최대
zh_hans: 材料拉满
zh_hant: 材料補滿

source: Max Craft Materials
ko: 제작재료 최대
zh_hans: 制作材料拉满
zh_hant: 製作材料補滿

source: Max Farm Seeds
ko: 농장 씨앗 최대
zh_hans: 农场种子拉满
zh_hant: 農場種子補滿

source: Max Fish
ko: 물고기 최대
zh_hans: 鱼类拉满
zh_hant: 魚類滿級

source: Max Inventory Items
ko: 인벤토리 아이템 최대
zh_hans: 背包道具拉满
zh_hant: 背包道具補滿

source: Max Items
ko: 아이템 최대
zh_hans: 道具拉满
zh_hant: 道具補滿

source: Max Own
ko: 보유 최대
zh_hans: 已有拉满
zh_hant: 現有食材補滿

source: Max Owned Ingredients
ko: 보유 식재료 최대
zh_hans: 已有食材拉满
zh_hant: 已擁有食材補滿

source: Max Sea People Village
ko: 어인족 마을 최대
zh_hans: 鲛人村拉满
zh_hant: 魚人村補滿

source: Max Seeds
ko: 씨앗 최대
zh_hans: 种子拉满
zh_hant: 種子補滿

source: Max Staff
ko: 직원 최대
zh_hans: 员工拉满
zh_hant: 員工滿等

source: Max Staff Levels
ko: 직원 레벨 최대
zh_hans: 员工等级拉满
zh_hant: 員工等級全滿

source: Max Village
ko: 마을 최대
zh_hans: 村庄拉满
zh_hant: 村莊補滿

source: Maxed %lld staff member(s) to level 20.
ko: 직원 %lld명을 레벨 20으로 올렸습니다.
zh_hans: 已将 %lld 名员工提升至 20 级。
zh_hant: 已將 %lld 名員工提升至 20 級。

source: Maxed Sea People Village storage (%lld slots).
ko: 어인족 마을 인벤토리를 최대로 채웠습니다(%lld칸).
zh_hans: 已拉满鲛人村库存（%lld 格）。
zh_hant: 已補滿魚人村庫存（%lld 格）。

source: Maxed all ingredients (skips perishable aberration fish).
ko: 모든 식재료를 최대로 채웠습니다(사라지는 돌연변이 물고기 제외).
zh_hans: 已拉满全部食材（跳过易腐的突变鱼）。
zh_hant: 已補滿所有食材（略過易腐的突變魚）。

source: Maxed branch ingredients (skips aberration fish).
ko: 분점 식재료를 최대로 채웠습니다(돌연변이 물고기 제외).
zh_hans: 已拉满分店食材（跳过突变鱼）。
zh_hant: 已補滿分店食材（略過突變魚）。

source: Maxed craft materials (%lld slots).
ko: 제작재료를 최대로 채웠습니다(%lld칸).
zh_hans: 已拉满制作材料（%lld 格）。
zh_hant: 已補滿製作材料（%lld 格）。

source: Maxed farm seeds / produce (%lld stacks).
ko: 농장 씨앗·작물을 최대로 채웠습니다(%lld묶음).
zh_hans: 已拉满农场种子／作物（%lld 组）。
zh_hant: 已補滿農場種子／作物（%lld 疊）。

source: Maxed inventory items (%lld slots).
ko: 인벤토리 아이템을 최대로 채웠습니다(%lld칸).
zh_hans: 已拉满背包道具（%lld 格）。
zh_hant: 已補滿背包道具（%lld 格）。

source: Maxed owned ingredients (skips perishable aberration fish).
ko: 보유 식재료를 최대로 채웠습니다(사라지는 돌연변이 물고기 제외).
zh_hans: 已拉满已有食材（跳过易腐的突变鱼）。
zh_hant: 已補滿已擁有的食材（略過易腐的突變魚）。

source: More
ko: 더 보기
zh_hans: 更多
zh_hant: 更多

source: No backups yet
ko: 백업 없음
zh_hans: 暂无备份
zh_hant: 尚無備份

source: No changes to write.
ko: 저장할 변경 사항이 없습니다.
zh_hans: 没有需要写入的更改。
zh_hant: 沒有需要寫入的變更。

source: No inventory items.
ko: 인벤토리 아이템이 없습니다.
zh_hans: 背包中没有道具。
zh_hant: 背包中沒有道具。

source: No items match “%@”.
ko: “%@”에 해당하는 아이템이 없습니다.
zh_hans: 没有匹配“%@”的道具。
zh_hant: 沒有符合「%@」的道具。

source: No matches for “%@”
ko: “%@” 검색 결과 없음
zh_hans: 没有匹配“%@”的结果
zh_hant: 找不到符合「%@」的結果

source: No matches.
ko: 검색 결과가 없습니다.
zh_hans: 无匹配结果。
zh_hant: 沒有符合的結果。

source: No save loaded
ko: 불러온 세이브 없음
zh_hans: 未载入存档
zh_hant: 尚未載入存檔

source: No save slots detected
ko: 세이브 슬롯 없음
zh_hans: 未检测到存档位
zh_hant: 未偵測到任何存檔

source: Not affiliated with MINTROCKET or NEXON. “Dave the Diver” is their name, used here only to say which game this edits.
ko: MINTROCKET, NEXON과 아무 관계가 없습니다. “Dave the Diver”(데이브 더 다이버)는 그들의 이름이고, 여기서는 어떤 게임을 편집하는지 밝히려고 썼을 뿐입니다.
zh_hans: 与 MINTROCKET、NEXON 没有任何关系。“Dave the Diver”（《潜水员戴夫》）是他们的名字，这里只是用来说明本程序编辑的是哪款游戏。
zh_hant: 與 MINTROCKET、NEXON 沒有任何關係。「Dave the Diver」（《潛水員戴夫》）是他們的名字，這裡只是用來說明本程式是編輯哪一款遊戲。

source: Not now
ko: 나중에
zh_hans: 以后再说
zh_hant: 以後再說

source: Nothing loaded
ko: 불러온 항목 없음
zh_hans: 未载入内容
zh_hant: 尚未載入任何內容

source: Nothing to fill.
ko: 채울 항목이 없습니다.
zh_hans: 没有可填充的内容。
zh_hant: 沒有可補滿的項目。

source: OK
ko: 확인
zh_hans: 好
zh_hant: 好

source: Open
ko: 열기
zh_hans: 打开
zh_hant: 開啟

source: Open %@
ko: %@ 열기
zh_hans: 打开 %@
zh_hant: 開啟 %@

source: Open File…
ko: 파일 열기…
zh_hans: 打开文件…
zh_hant: 開啟檔案…

source: Open Save…
ko: 세이브 열기…
zh_hans: 打开存档…
zh_hant: 開啟存檔…

source: Open a Dave the Diver save file to begin.
ko: 《데이브 더 다이버》 세이브 파일을 열어 시작하세요.
zh_hans: 打开一个《潜水员戴夫》存档文件即可开始。
zh_hant: 請開啟《潛水員戴夫》存檔以開始。

source: Open a save slot or choose a file
ko: 세이브 슬롯을 열거나 파일을 선택
zh_hans: 打开存档位或选择文件
zh_hant: 開啟存檔格或選擇檔案

source: Original Windows save editor — feature set, save-path knowledge, and ingredient reference data.
ko: 원조 Windows 세이브 편집기 — 기능 구성, 세이브 경로 정보, 식재료 참조 데이터.
zh_hans: 原版 Windows 存档修改器——功能设计、存档路径与食材参考数据。
zh_hant: 原始的 Windows 存檔修改器 — 功能設計、存檔路徑資訊與食材參考資料。

source: PlayerInfo.m_FakePoint — fake / counterfeit points
ko: PlayerInfo.m_FakePoint — 가짜 포인트
zh_hans: PlayerInfo.m_FakePoint——伪造／仿冒点数
zh_hant: PlayerInfo.m_FakePoint — 偽造／仿冒點數

source: PlayerInfo.m_trustPoint — Sea People Village trust, shown in-game as “Credit”
ko: PlayerInfo.m_trustPoint — 주민 신뢰도
zh_hans: PlayerInfo.m_trustPoint——村民信任度
zh_hant: PlayerInfo.m_trustPoint — 村民信賴度

source: Raise general materials / crafting parts.
ko: 일반 재료·제작 부품을 올립니다.
zh_hans: 提升通用材料／制作零件的数量。
zh_hant: 補滿一般材料／製作零件。

source: Ran every fill — %@.
ko: 모든 채우기를 실행했습니다 — %@.
zh_hans: 已执行所有填充——%@。
zh_hant: 已執行所有補滿 — %@。

source: Raw JSON viewer and backups
ko: 원본 JSON 뷰어 및 백업
zh_hans: 原始 JSON 检视器与备份
zh_hant: 原始 JSON 檢視器與備份

source: Raw JSON…
ko: 원본 JSON…
zh_hans: 原始 JSON…
zh_hant: 原始 JSON…

source: Raw Save · read-only
ko: 원본 세이브 · 읽기 전용
zh_hans: 原始存档 · 只读
zh_hant: 原始存檔 · 唯讀

source: Read-only on purpose: editing raw values can unlock content out of order and soft-lock a run. Use the editor rows — they clamp to safe values.
ko: 의도적으로 읽기 전용입니다. 원본 값을 직접 고치면 콘텐츠가 순서와 다르게 해금되어 진행이 막힐 수 있습니다. 안전한 범위로 제한되는 편집 행을 사용하세요.
zh_hans: 这里刻意设为只读：直接修改原始数值可能让内容提前解锁，导致该周目卡死。请使用会限制在安全范围内的编辑行。
zh_hant: 這裡刻意設為唯讀：直接修改原始數值可能讓內容提前解鎖，導致該周目卡死。請使用會限制在安全範圍內的編輯列。

source: Record the top size (grade 5) for every fish already caught. Doesn't add uncaught fish.
ko: 이미 잡은 물고기의 크기를 최고 등급(5등급)으로 기록합니다. 잡지 않은 물고기는 추가되지 않습니다.
zh_hans: 将已捕获鱼类的记录设为最大尺寸（5 级），不会添加未捕获的鱼。
zh_hant: 將所有已捕獲的魚類記錄為最大尺寸（等級 5）。不會新增未捕獲的魚。

source: Redid last edit.
ko: 마지막 편집을 다시 실행했습니다.
zh_hans: 已重做上一次修改。
zh_hant: 已重做上一次修改。

source: Redo
ko: 다시 실행
zh_hans: 重做
zh_hant: 重做

source: Redo %@
ko: %@ 다시 실행
zh_hans: 重做%@
zh_hant: 重做%@

source: Reference Data Error
ko: 참조 데이터 오류
zh_hans: 参考数据错误
zh_hant: 參考資料錯誤

source: Report a Problem…
ko: 문제 신고…
zh_hans: 报告问题…
zh_hant: 回報問題…

source: Report a bad translation
ko: 잘못된 번역 알려주기
zh_hans: 反馈翻译错误
zh_hant: 回報翻譯錯誤

source: Research Point
ko: 연구포인트
zh_hans: 研究点数
zh_hant: 研究點數

source: Reset
ko: 초기화
zh_hans: 重置
zh_hant: 重設

source: Reset %@
ko: %@ 초기화
zh_hans: 重置 %@
zh_hant: 重設 %@

source: Restaurant
ko: 식당
zh_hans: 餐厅
zh_hant: 餐廳

source: Restore
ko: 복구
zh_hans: 恢复
zh_hant: 回復

source: Restore & Overwrite
ko: 복구 후 덮어쓰기
zh_hans: 恢复并覆盖
zh_hant: 回復並覆寫

source: Restore Failed
ko: 복구 실패
zh_hans: 恢复失败
zh_hant: 回復失敗

source: Restore from Backup
ko: 백업에서 복구
zh_hans: 从备份恢复
zh_hant: 從備份回復

source: Restore from Backup…
ko: 백업에서 복구…
zh_hans: 从备份恢复…
zh_hant: 從備份回復…

source: Restore this backup?
ko: 이 백업을 복구할까요?
zh_hans: 要恢复此备份吗？
zh_hant: 要回復這份備份嗎？

# Restored %@. Your previous state was saved as %@ — reveal it to undo.
source: Restored %1$@. Your previous state was saved as %2$@ — reveal it to undo.
ko: %@을(를) 복구했습니다. 이전 상태는 %@(으)로 저장했으니, 되돌리려면 해당 파일을 확인하세요.
zh_hans: 已恢复 %@。之前的状态已保存为 %@——在访达中显示即可撤销。
zh_hant: 已回復 %@。先前的狀態已備份為 %@ — 在 Finder 中顯示即可還原。

source: Reveal Backup in Finder
ko: Finder에서 백업 보기
zh_hans: 在访达中显示备份
zh_hant: 在 Finder 中顯示備份

source: Review Changes
ko: 변경 사항 검토
zh_hans: 查看更改
zh_hant: 檢視變更

source: Review the changes, then write them to the save
ko: 변경 사항을 확인한 뒤 세이브에 기록
zh_hans: 先检查更改，然后写入存档
zh_hant: 先檢視變更，再寫入存檔

source: Run All Fills
ko: 모든 채우기 실행
zh_hans: 执行所有填充
zh_hant: 執行所有補滿

source: Run every bulk fill at once. Does not change any currency.
ko: 모든 일괄 채우기를 한 번에 실행합니다. 재화는 변경되지 않습니다.
zh_hans: 一次执行所有批量填充。不会改动任何货币。
zh_hant: 一次執行所有批次補滿。不會改動任何貨幣。

source: Save
ko: 저장
zh_hans: 保存
zh_hant: 儲存

source: Save Written
ko: 세이브 저장 완료
zh_hans: 存档已写入
zh_hant: 存檔已寫入

source: Save codec reverse-engineering (char-level UTF-16 XOR).
ko: 세이브 코덱 리버스 엔지니어링(문자 단위 UTF-16 XOR).
zh_hans: 存档编解码逆向分析（字符级 UTF-16 异或）。
zh_hant: 存檔編解碼逆向工程（字元層級 UTF-16 XOR）。

source: Save slots
ko: 세이브 슬롯
zh_hans: 存档位
zh_hant: 存檔格

source: Save…
ko: 저장…
zh_hans: 保存…
zh_hant: 儲存…

source: Sea People Village currency
ko: 어인족 마을 재화
zh_hans: 鲛人族（鲛人村）货币
zh_hant: 魚人村貨幣

source: Search an item by name (or a numeric ID), pick it, then set a count.
ko: 이름(또는 숫자 ID)으로 아이템을 검색해 선택한 뒤 개수를 지정하세요.
zh_hans: 按名称（或数字 ID）搜索道具，选中后设置数量。
zh_hant: 以名稱（或數字 ID）搜尋道具，選取後再設定數量。

source: Search item name or ID…
ko: 아이템 이름 또는 ID 검색…
zh_hans: 搜索道具名称或 ID…
zh_hant: 搜尋道具名稱或 ID…

source: Search items by name…
ko: 이름으로 아이템 검색…
zh_hans: 按名称搜索道具…
zh_hant: 以名稱搜尋道具…

source: Search keys or values…
ko: 키 또는 값 검색…
zh_hans: 搜索键或值…
zh_hant: 搜尋鍵或值…

# Set %@ (%@) → %lld.
source: Set %1$@ (%2$@) → %3$lld.
ko: %@(%@)을(를) %lld(으)로 설정했습니다.
zh_hans: 设置 %@（%@）→ %lld。
zh_hant: 已將 %@（%@）設為 %lld。

source: Set %@ count
ko: %@ 개수 설정
zh_hans: 设置 %@ 数量
zh_hant: 設定 %@ 數量

source: Set %@ to an exact value
ko: %@을(를) 원하는 값으로 설정
zh_hans: 将 %@ 设为指定数值
zh_hant: 將 %@ 設為指定數值

source: Set %@ to maximum
ko: %@을(를) 최대로 설정
zh_hans: 将 %@ 设为最大值
zh_hant: 將 %@ 設為最大值

source: Set %lld caught fish to top grade.
ko: 잡은 물고기 %lld종을 최고 등급으로 설정했습니다.
zh_hans: 已将 %lld 条已捕获鱼类设为最高等级。
zh_hant: 已將 %lld 種已捕魚類設為最高等級。

source: Source Code
ko: 소스 코드
zh_hans: 源代码
zh_hant: 原始碼

source: Spent on research & recipes
ko: 연구·레시피에 사용
zh_hans: 用于研究与料理食谱
zh_hant: 用於研究與食譜

source: Steam Cloud has a copy of this save (%@). Turn Cloud off for Dave the Diver in Steam, or it can replace your edit before the game loads.
ko: Steam 클라우드에 이 세이브의 복사본이 있습니다(%@). Steam에서 데이브 더 다이버의 클라우드를 끄지 않으면, 게임이 시작되기 전에 편집 내용이 교체될 수 있습니다.
zh_hans: Steam 云存档中已有这份存档的副本（%@）。请在 Steam 中关闭《潜水员戴夫》的云同步，否则游戏载入前你的修改可能被替换掉。
zh_hant: Steam Cloud 中已有這份存檔的副本（%@）。請在 Steam 關閉《潛水員戴夫》的雲端同步，否則遊戲載入前你的修改可能會被換掉。

source: Stock fish parts + DREDGE research parts/bones so weapon crafting is unblocked. Adds parts you haven't found yet.
ko: 무기 제작이 막히지 않도록 물고기 부위와 드렛지 연구 부품·뼈를 채웁니다. 아직 찾지 못한 부품도 추가됩니다.
zh_hans: 补满鱼类部件与《渔帆暗涌》研究部件／骨头，解除武器制作限制。会添加你还没找到的部件。
zh_hant: 備齊魚類零件與《漁帆暗湧》研究零件／骨頭，解除武器製作限制。會加入你還沒找到的零件。

source: Stock the branch's separate ingredient counts — run alongside Max Owned.
ko: 분점의 별도 재고를 채웁니다 — 「보유 최대」와 함께 실행하세요.
zh_hans: 补满分店独立计算的食材数量——建议与“已有食材拉满”配合使用。
zh_hant: 補滿分店獨立計算的食材數量 — 請搭配「已擁有食材補滿」一起執行。

# Subtract %lld from %@
source: Subtract %1$lld from %2$@
ko: %2$@에서 %1$lld 빼기
zh_hans: 从 %2$@ 减少 %1$lld
zh_hant: 從 %2$@ 減去 %1$lld

source: Support
ko: 후원
zh_hans: 赞助
zh_hant: 贊助

source: Support the Project
ko: 프로젝트 후원하기
zh_hans: 赞助这个项目
zh_hant: 贊助這個專案

source: Support the Project…
ko: 프로젝트 후원하기…
zh_hans: 赞助这个项目…
zh_hant: 贊助這個專案…

source: Support the project
ko: 프로젝트 후원하기
zh_hans: 赞助这个项目
zh_hant: 贊助這個專案

source: That's %@ saves you've edited with DiveSaveEd
ko: DiveSaveEd로 세이브를 %@번 수정하셨네요
zh_hans: 你已经用 DiveSaveEd 改了 %@ 次存档
zh_hant: 你已經用 DiveSaveEd 改了 %@ 次存檔

source: The most useful help is a bug report or a translation fix.
ko: 가장 도움이 되는 건 버그 신고나 번역 수정입니다.
zh_hans: 最有帮助的是提一个 bug 或修正一处翻译。
zh_hant: 最有幫助的是回報一個 bug 或修正一處翻譯。

source: The save file is currently open by another process. If you just quit the game, wait a moment and try again.
ko: 다른 프로세스가 세이브 파일을 열고 있습니다. 게임을 방금 종료했다면 잠시 기다린 뒤 다시 시도하세요.
zh_hans: 存档文件正被其他程序占用。如果你刚刚退出游戏，请稍等一下再试。
zh_hant: 存檔檔案正被其他程式開啟。如果你剛剛結束遊戲，請稍等一下再試。

source: The save was written but did not read back correctly. Your original is in the backup — restore it before playing.
ko: 세이브를 기록했지만 다시 읽어들이는 데 실패했습니다. 원본은 백업에 있으니, 게임을 실행하기 전에 복구하세요.
zh_hans: 存档已写入，但回读校验失败。原始存档在备份中——请在开始游戏前先恢复。
zh_hant: 存檔已寫入，但回讀驗證失敗。原始存檔在備份中 — 請在開始遊戲前先回復。

source: This file isn't a readable Dave the Diver save.
ko: 이 파일은 읽을 수 있는 《데이브 더 다이버》 세이브가 아닙니다.
zh_hans: 该文件不是可读取的《潜水员戴夫》存档。
zh_hant: 此檔案不是可讀取的《潛水員戴夫》存檔。

source: This overwrites the current save with the backup. Your current state is backed up first, so it's reversible.
ko: 백업으로 현재 세이브를 덮어씁니다. 현재 상태를 먼저 백업하므로 언제든 되돌릴 수 있습니다.
zh_hans: 这将用备份覆盖当前存档。当前状态会先行备份，因此可以撤销。
zh_hant: 這會以備份覆寫目前的存檔。目前狀態會先行備份，因此這個動作是可逆的。

source: Turn off Steam Cloud for Dave the Diver before playing, or it can overwrite this save on its next sync.
ko: 게임을 실행하기 전에 데이브 더 다이버의 Steam 클라우드를 꺼 주세요. 그렇지 않으면 다음 동기화에서 이 세이브를 덮어씁니다.
zh_hans: 开始游戏前请关闭《潜水员戴夫》的 Steam 云同步，否则下次同步会覆盖这份存档。
zh_hant: 開始遊戲前請關閉《潛水員戴夫》的 Steam Cloud，否則下次同步會覆寫這份存檔。

source: Undid last edit.
ko: 마지막 편집을 되돌렸습니다.
zh_hans: 已撤销上一次修改。
zh_hant: 已還原上一次修改。

source: Undo
ko: 되돌리기
zh_hans: 撤销
zh_hant: 還原

source: Undo %@
ko: %@ 되돌리기
zh_hans: 撤销%@
zh_hant: 還原%@

source: Undo last edit
ko: 마지막 편집 되돌리기
zh_hans: 撤销上一次修改
zh_hant: 還原上一次修改

source: Unsaved changes
ko: 저장하지 않은 변경 사항
zh_hans: 有未保存的更改
zh_hant: 有未儲存的變更

source: Value
ko: 값
zh_hans: 数值
zh_hant: 數值

source: Values
ko: 값
zh_hans: 数值
zh_hant: 數值

# Version %@ (build %@)
source: Version %1$@ (build %2$@)
ko: 버전 %@(빌드 %@)
zh_hans: 版本 %@（构建版本 %@）
zh_hant: 版本 %@（組建 %@）

source: Weapon-upgrade currency
ko: 무기 강화 재화
zh_hans: 武器强化货币
zh_hant: 武器升級貨幣

source: Would clamp %@ to 0
ko: %@을(를) 0으로 만듭니다
zh_hans: 会把%@清零
zh_hant: 會把 %@ 歸零

source: Write Failed
ko: 저장 실패
zh_hans: 写入失败
zh_hant: 寫入失敗

source: Write Save
ko: 세이브 저장
zh_hans: 写入存档
zh_hant: 寫入存檔

source: Your changes were written to %@. A timestamped backup was saved first.
ko: 변경 사항을 %@에 저장했습니다. 시각이 기록된 백업을 먼저 만들었습니다.
zh_hans: 更改已写入 %@。已先保存一份带时间戳的备份。
zh_hant: 變更已寫入 %@。已先建立帶時間戳記的備份。

source: Your edits to this save haven't been written. Opening another save will discard them.
ko: 이 세이브의 편집 내용이 아직 저장되지 않았습니다. 다른 세이브를 열면 변경 사항이 사라집니다.
zh_hans: 对该存档的修改尚未写入。打开其他存档将丢弃这些修改。
zh_hant: 此存檔的修改尚未寫入。開啟其他存檔將會捨棄這些修改。

source: item
ko: 아이템
zh_hans: 道具
zh_hant: 道具

source: item %@
ko: 아이템 %@
zh_hans: 道具 %@
zh_hant: 道具 %@
